Revit 2027 API
ParameterTypeId.MepSegmentSystemorservice Property
 "System Type/Service Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MepSegmentSystemorservice { get; }
Public Shared ReadOnly Property MepSegmentSystemorservice As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MepSegmentSystemorservice {
	ForgeTypeId^ get ();
}
static member MepSegmentSystemorservice : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace